src/Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who added the file</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Date of adding file to the database</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Comment>File description</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Signed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockedBy</Name>
					<Comment>User, locked file for edit</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Comment>Active version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionDateCreated</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Comment>Store versions - if False, file always has single Active version</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/WorkWithScannerClient/Ext/Module.bsl
// Installs scanning component
Procedure SetComponent() Export

	If TwainComponent = Undefined Then
		ReturnCode = AttachAddIn("CommonTemplate.TwainComponent", "twain", AddInType.Native);
		
		If ReturnCode Then
			Status(NStr("en = 'Scanning component is already installed!'"));
		Else
			InstallAddIn("CommonTemplate.TwainComponent");
			ReturnCode = AttachAddIn("CommonTemplate.TwainComponent", "twain", AddInType.Native);
			
			If ReturnCode Then
				FileOperations.DeleteNewFileFormSettings();
				RefreshReusableValues();
				Notify("ScanningComponentInstalled");
			EndIf;
		EndIf;

		TwainComponent = New("AddIn.twain.AddInNativeExtension");	
	Else
		Status(NStr("en = 'Scanning component is already installed!'"));
	EndIf;
	
EndProcedure

// Initialize scanning component
Function InitializeComponent() Export
	If TwainComponent = Undefined Then
		ReturnCode = AttachAddIn("CommonTemplate.TwainComponent", "twain", AddInType.Native);
		
		If Not ReturnCode Then
			Return False;
		EndIf;

		TwainComponent = New("AddIn.twain.AddInNativeExtension");	
	EndIf;
	
	Return True;
EndFunction

// Returns version of the scanning component
Function ScanComponentVersion() Export

	If Not InitializeComponent() Then
		Return NStr("en = 'Scanning component is not installed'");
	EndIf;
	
	Return TwainComponent.Version();
EndFunction // ScanComponentVersion()

// Return array of lines - of TWAIN device
Function GetDevices() Export
	Array = New Array;
	
	If Not InitializeComponent() Then
		Return Array;
	EndIf;
	
	DevicesString = TwainComponent.GetDevices();
	
	For IndexOf = 1 To StrLineCount(DevicesString) Do
		String = StrGetLine(DevicesString, IndexOf); 		
		Array.Add(String);
	EndDo;	
	
	Return Array;
EndFunction // GetDevices()

// Call scan dialog and dispay picture preview dialog
Procedure ScanAndShowViewDialog(FileOwner, UUID, ThisForm,
	DoNotOpenCardAfterCreateFromFile = Undefined) Export
	
	SystemInfo = New SystemInfo();
	ClientID = SystemInfo.ClientID;
	
	OpenParameters = New Structure("FileOwner, DoNotOpenCardAfterCreateFromFile, ClientID", 
							FileOwner, DoNotOpenCardAfterCreateFromFile, ClientID);
	OpenFormModal("Catalog.Files.Form.ScanningResult", OpenParameters);
	
EndProcedure

// Return True, if command Scan is available - scan component is installed and at least one scanner is present
Function CommandScanAvailable() Export

	If Not InitializeComponent() Then
		Return False;
	EndIf;
	
	If TwainComponent.IsDevicePresent() then
		Return True;
	EndIf;
	
	Return False;
	
EndFunction // CommandScanAvailable()


// Gets scanner setting by name
//
// Parameters
//  DeviceName  	- String - Scanner name
//
//  SettingsName  	- String - setting name, for example "XRESOLUTION" or "PIXELTYPE" or "ROTATION" or "SUPPORTEDSIZES"
//
//
// Value returned:
//   Number   		- Scanner setting value
//
Function GetSetting(DeviceName, SettingsName) Export
	
	Try
		Return TwainComponent.GetSetting(DeviceName, SettingsName);
	Except
		Return -1;
	EndTry;
	
EndFunction // GetSetting()

// Saves chromaticity and resolution in settings
Procedure SaveScannerParametersInPreferences(Resolution, Chromaticity, Rotation, PaperSize) Export
	
	StructuresArray = New Array;
	
	SystemInfo 	= New SystemInfo();
	ClientID 	= SystemInfo.ClientID;
	
	Item = New Structure;
	Item.Insert("Object", "ScanSettings/Resolution");
	Item.Insert("Options", ClientID);
	Item.Insert("Value", Resolution);
	StructuresArray.Add(Item);
	
	Item = New Structure;
	Item.Insert("Object", "ScanSettings/Chromaticity");
	Item.Insert("Options", ClientID);
	Item.Insert("Value", Chromaticity);
	StructuresArray.Add(Item);
	
	Item = New Structure;
	Item.Insert("Object", "ScanSettings/Rotation");
	Item.Insert("Options", ClientID);
	Item.Insert("Value", Rotation);
	StructuresArray.Add(Item);
	
	Item = New Structure;
	Item.Insert("Object", "ScanSettings/PaperSize");
	Item.Insert("Options", ClientID);
	Item.Insert("Value", PaperSize);
	StructuresArray.Add(Item);
	
	CommonUse.CommonSettingsStorageSaveArray(StructuresArray);
	
EndProcedure
